MatsDeMeyer/RF-Survey-BLE/Embedded NRF Project/pca10040/s132/armgcc/nrf52SDKWrap.c
/*
 * atCommand.c
 *
 *  Created on: 7 Nov 2017
 *      Author: Fifth
 */


#include "defaultParameters.h"
#include "nrf_delay.h"
#include <stdint.h>
#include <string.h>
#include "stdio.h"
#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "nrf_ble_gatt.h"
#include "app_timer.h"
#include "ble_nus.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "bsp_btn_ble.h"
#include "nrf_nvic.h"
#include "nrf_sdm.h"
#include <ble_gap.h>
#include <nrf52SDKWrap.h>
#if defined (UART_PRESENT)
#include "nrf_uart.h"
#endif
#if defined (UARTE_PRESENT)
#include "nrf_uarte.h"
#endif

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "fifo.h"

fifo_t uartfifo;
uint8_t uartByte;
uint8_t uart_buffer[50];

BLE_NUS_DEF(m_nus);                                                                 /**< BLE NUS service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
BLE_ADVERTISING_DEF(m_advertising);													/**< Advertising module instance. */


char* APP_ADV_INTERVAL = DEFAULT_APP_ADV_INTERVAL ;                                 /**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */
char* APP_ADV_TIMEOUT_IN_SECONDS = DEFAULT_APP_ADV_TIMEOUT_IN_SECONDS    ;          /**< The advertising timeout (in units of seconds). */
char* MIN_CONN_INTERVAL = DEFAULT_MIN_CONN_INTERVAL;          						/**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
char* MAX_CONN_INTERVAL = DEFAULT_MAX_CONN_INTERVAL;       							/**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
char *DEVICE_NAME=DEFAULT_DEVICE_NAME;                             					/**< Name of device. Will be included in the advertising data. */
char* SLAVE_LATENCY= DEFAULT_SLAVE_LATENCY;                                        	/**< Slave latency. */
char* commands;
static uint8_t sendBuffer[AT_COMMAND_MAX_LENGTH];

static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
ble_uuid_t m_adv_uuids[]          =                                          		/**< Universally unique service identifier. */
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};

ble_nus_data_handler_t client_data_handler;
bool setup=true;
bool initBluetooth=false;
bool fullName=DEFAULT_FULL_NAME;
uint8_t advertisementData[20] = DEFAULT_ADV_DATA;
uint8_t advertisementDataSize=1;
uint8_t shortNameLength=DEFAULT_SHORT_NAME_LENGTH ;
uint8_t attMtuSize=DEFAULT_ATT_MTU_SIZE ;
char attMtuSizeArray[4];
char shortNameLengthArray[3];
char deviceName[20];
char slaveLatency[10];
char maxConInt[10];
char minConInt[10];
char advInterval[10];
char power[10];




void printSettings()
{
	printf("%s", help1);
	printf("%s", help2);
	printf("%s", help3);
	printf("%s", help4);
	printf("%s", help5);
	printf("%s", help6);
	printf("%s", help7);
}

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
	printf("%c\r\n", line_num);
	    			printf("%s\r\n", p_file_name);
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
    //BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = atoi(MIN_CONN_INTERVAL);
    gap_conn_params.max_conn_interval = atoi(MAX_CONN_INTERVAL);
    gap_conn_params.slave_latency     = atoi(SLAVE_LATENCY);
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);


}


/**@brief Function for initializing services that will be used by the application.
 */
void services_init(ble_nus_data_handler_t data_handler)
{
	client_data_handler=data_handler;
    uint32_t       err_code;
    ble_nus_init_t nus_init;

    memset(&nus_init, 0, sizeof(nus_init));

    //nus_init.data_handler = nus_data_handler;
    nus_init.data_handler = client_data_handler;

    err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

