MatsDeMeyer/RF-Survey-BLE/Embedded NRF Project/pca10040/s132/armgcc/nrf52SDKWrap.c
/**@brief Function for the SoftDevice initialization.
 *
 * @details This function initializes the SoftDevice and the BLE event interrupt.
 */
void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


/**@brief Function for handling events from the GATT library. */
void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
    if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
    {
        m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
        NRF_LOG_INFO("Data len is set to 0x%X(%d)", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
    }
    NRF_LOG_DEBUG("ATT MTU exchange completed. central 0x%x peripheral 0x%x",
                  p_gatt->att_mtu_desired_central,
                  p_gatt->att_mtu_desired_periph);
}


/**@brief Function for initializing the GATT library. */
void gatt_init(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, attMtuSize);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    uint32_t err_code;
    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break;

        default:
            break;
    }
}
void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;

    ble_advdata_manuf_data_t        manuf_data; // Variable to hold manufacturer specific data
        //uint8_t data[]                      = "1"; // Our data to adverise
        manuf_data.company_identifier       = 0x0059; // Nordics company ID
        manuf_data.data.p_data              = advertisementData;
        manuf_data.data.size                = advertisementDataSize;

    memset(&init, 0, sizeof(init));
    if(fullName)
    {
    	init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    }
    else
    {
		init.advdata.name_type          = BLE_ADVDATA_SHORT_NAME;
		init.advdata.short_name_len = shortNameLength; // Advertise only first 6 letters of name
    }
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE; //allow unlimited timeout
    init.advdata.p_manuf_specific_data   = &manuf_data;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;


    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = atoi(APP_ADV_INTERVAL);
    init.config.ble_adv_fast_timeout  = atoi(APP_ADV_TIMEOUT_IN_SECONDS);

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}
uint32_t startSoftdevice(){
	uint32_t err_code;
	gap_params_init();
	gatt_init();
	services_init(client_data_handler);
	advertising_init();
	conn_params_init();
	err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
	return err_code;
}
uint32_t changeAdvInt(char array[]){
	uint32_t err_code;


	APP_ADV_INTERVAL=&array[0];

	sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
	sd_ble_gap_adv_stop();
	advertising_init();
	err_code=ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST); //start
	return err_code;
}
uint32_t changeDevName(char array[]){
	uint32_t err_code;

	DEVICE_NAME=&array[0];

	 ble_gap_conn_sec_mode_t sec_mode;
	 sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
	 sd_ble_gap_adv_stop();

	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

	sd_ble_gap_device_name_set(&sec_mode, (const uint8_t *) DEVICE_NAME,  strlen(DEVICE_NAME));
	advertising_init();
	err_code=ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST); //start
	return err_code;
}


uint32_t changeMinConInt(char array[]){
	MIN_CONN_INTERVAL=&array[0];

	if(atoi(&array[0])<=atoi(MAX_CONN_INTERVAL))
	{
		MIN_CONN_INTERVAL=&array[0];
		gap_params_init();
		return NRF_SUCCESS;
	}
	else
		return 8;

}

uint32_t changeMaxConInt(char array[]){

	if(atoi(MIN_CONN_INTERVAL)<=atoi(&array[0]))
	{
		MAX_CONN_INTERVAL=&array[0];
			gap_params_init();
		return NRF_SUCCESS;
	}
	else
		return 8;
}
uint32_t changeSlaveLatency(char array[]){
	uint32_t err_code;

	if(atoi(&slaveLatency[0])>=0)
	{
		SLAVE_LATENCY=&slaveLatency[0];
		gap_params_init();
		err_code=NRF_SUCCESS;
	}
	else
		return 8;
	return err_code;
}
uint32_t changeAdvData(uint8_t array[],uint8_t length){
	uint32_t err_code;
	advertisementDataSize=length;
	 sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
	 sd_ble_gap_adv_stop();
	advertising_init();
	err_code=ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST); //start
	return err_code;
}
uint32_t setAdvFullName(uint8_t fullName2){
	uint32_t err_code;
	fullName=(fullName2==1);
	 sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
	 sd_ble_gap_adv_stop();
	advertising_init();
	err_code=ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST); //start
	return err_code;
}
uint32_t setAdvNameLength(uint8_t length){
	uint32_t err_code;
	shortNameLength=length;

	 sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
	 sd_ble_gap_adv_stop();
	advertising_init();
	err_code=ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST); //start
	return err_code;
}
uint32_t changeMtuAttSize(uint8_t size)
{
	uint32_t err_code;
	attMtuSize=size;

	err_code=nrf_ble_gatt_att_mtu_periph_set(&m_gatt, attMtuSize);
	return err_code;
}
uint32_t resetDevice(){
	uint32_t err_code;
	sd_nvic_SystemReset();
	err_code=1;
	return err_code;
}
uint32_t stopSoftDevice(){
	uint32_t err_code;
	err_code=nrf_sdh_disable_request();
	ble_stack_init();
	return err_code;
}
uint32_t stopAdv(){
	uint32_t err_code;
	//disconnectFromMaster();
	//nrf_delay_ms(1000);
	err_code=sd_ble_gap_adv_stop();
	return err_code;
}
uint32_t startAdv(){
	uint32_t err_code;
	err_code =ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST); //start
	return err_code;
}
uint32_t disconnectFromMaster(){
	uint32_t err_code;
	err_code=sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
	return err_code;
}
uint32_t changeTransmitPower(int8_t power){
	uint32_t err_code;
	err_code=sd_ble_gap_tx_power_set(power);
	return err_code;
}
uint32_t sendBleText(uint8_t array[],uint16_t length1){
	uint32_t err_code;
	do
	{
		//uint16_t length1 = sizeof(array);
		err_code = ble_nus_string_send(&m_nus, array, &length1);
		if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_BUSY) )
		{
			APP_ERROR_CHECK(err_code);
		}
	} while (err_code == NRF_ERROR_BUSY);
	return err_code;
}
uint32_t changePhyMode(uint8_t mode){
	uint32_t err_code;
	ble_gap_phys_t gap_phys_settings;
	if(mode==1)
	{
		gap_phys_settings.tx_phys =BLE_GAP_PHY_1MBPS;
		gap_phys_settings.rx_phys = BLE_GAP_PHY_1MBPS;
	}
	else if(mode==2)
	{
		gap_phys_settings.tx_phys =BLE_GAP_PHY_2MBPS;
		gap_phys_settings.rx_phys = BLE_GAP_PHY_2MBPS;
	}
	else if(mode==3)
	{
		gap_phys_settings.tx_phys =BLE_GAP_PHY_CODED;
		gap_phys_settings.rx_phys = BLE_GAP_PHY_CODED;
	}
	else if(mode==0)
	{
		gap_phys_settings.tx_phys =BLE_GAP_PHY_AUTO;
		gap_phys_settings.rx_phys = BLE_GAP_PHY_AUTO;
	}
	else
		return 1;
	err_code=sd_ble_gap_phy_update(m_nus.conn_handle, &gap_phys_settings);
	return err_code;
}
void getCommandType(char array[], int length)//AT+SETTINGS:
{
	int i=0;
	char a[length];
	strncpy(a, array, length);
	commands= &a[0];
	uint32_t err_code;


	if(strstr(commands,"at+")!=NULL)
		if(strstr(commands,"at+start")!=NULL)
		{
			err_code = startSoftdevice();

			if(err_code==NRF_SUCCESS)
				printf("OK\r\n");
			else
				printf("ERROR: %lu \r\n", (unsigned long)err_code);
		}
		else if(strstr(commands,"at+type=")!=NULL)
		{
			printf("%s", TYPEAPP);
		}
		else if(strstr(commands,"at+help")!=NULL)
		{
			printSettings();

