MatsDeMeyer/RF-Survey-BLE/Embedded NRF Project/pca10040/s132/armgcc/nrf52SDKWrap.c
		}
		else if(strstr(commands,"at+settings")!=NULL)
		{
			printf("Device name: ");
			printf("%s\r\n", DEVICE_NAME);

			printf("APP_ADV_INTERVAL: ");
			printf("%s\r\n", APP_ADV_INTERVAL);

			printf("APP_ADV_TIMEOUT_IN_SECONDS: ");
			printf("%s\r\n", APP_ADV_TIMEOUT_IN_SECONDS);

			printf("MAX_CONN_INTERVAL: ");
			printf("%s\r\n", MAX_CONN_INTERVAL);

			printf("MIN_CONN_INTERVAL: ");
			printf("%s\r\n", MIN_CONN_INTERVAL);

			printf("ADV_DATA: ");
			printf("%s\r\n", &advertisementData[0]);
		}
		else if(strstr(commands,"at+adv_int=")!=NULL)
		{
			memset(&advInterval[0], 0, sizeof(advInterval));
			for (i=0;i<(length-11);i++)
			{
				advInterval[i]=array[11+i];
			}

			err_code=changeAdvInt(advInterval); //start

			if(err_code==NRF_SUCCESS)
				printf("OK\r\n");
			else
				printf("ERROR: %lu \r\n", (unsigned long)err_code);

		}
		else if(strstr(commands,"at+dev_name=")!=NULL)
		{
			memset(&deviceName[0], 0, sizeof(deviceName));

			for (i=0;i<(length-12);i++)
			{
				deviceName[i]=array[12+i];
			}

			DEVICE_NAME=&deviceName[0];


			err_code=changeDevName(deviceName); //start

			if(err_code==NRF_SUCCESS)
				printf("OK\r\n");
			else
				printf("ERROR: %lu \r\n", (unsigned long)err_code);
		}
		else if(strstr(commands,"at+min_con_int=")!=NULL)
		{
			memset(&minConInt[0], 0, sizeof(minConInt));

			for (i=0;i<(length-15);i++)
			{
				minConInt[i]=array[15+i];
			}

			err_code=changeMinConInt(minConInt);

			if(err_code==NRF_SUCCESS)
				printf("OK\r\n");
			else
				printf("ERROR: %lu \r\n", (unsigned long)err_code);
		}
		else if(strstr(commands,"at+max_con_int=")!=NULL)
		{
			memset(&maxConInt[0], 0, sizeof(maxConInt));

			for (i=0;i<(length-15);i++)
			{
				maxConInt[i]=array[15+i];
			}

			err_code=changeMaxConInt(maxConInt);
			if(err_code==NRF_SUCCESS)
				printf("OK\r\n");
			else
				printf("ERROR: %lu \r\n", (unsigned long)err_code);
		}
		else if(strstr(commands,"at+slave_latency=")!=NULL)
		{
			memset(&slaveLatency[0], 0, sizeof(slaveLatency));

			for (i=0;i<(length-17);i++)
			{
				slaveLatency[i]=array[17+i];
			}

			err_code=changeSlaveLatency(slaveLatency);

			if(err_code==NRF_SUCCESS)
				printf("OK\r\n");
			else
				printf("ERROR: %lu \r\n", (unsigned long)err_code);
		}
		else if(strstr(commands,"at+adv_data=")!=NULL)
		{
			memset(&advertisementData[0], 0, sizeof(advertisementData));

			for (i=0;i<(length-12);i++)
			{
				advertisementData[i]=array[12+i];
			}

			err_code=changeAdvData(advertisementData,length-12); //start

			if(err_code==NRF_SUCCESS)
				printf("OK\r\n");
			else
				printf("ERROR: %lu \r\n", (unsigned long)err_code);
		}
		else if(strstr(commands,"at+adv_full_name=")!=NULL)
		{

			err_code=setAdvFullName((uint8_t)array[17]); //start

			if(err_code==NRF_SUCCESS)
				printf("OK\r\n");
			else
				printf("ERROR: %lu \r\n", (unsigned long)err_code);
		}
		else if(strstr(commands,"at+adv_name_length=")!=NULL)
		{
			memset(&shortNameLengthArray[0], 0, sizeof(shortNameLengthArray));
			for (i=0;i<(length-19);i++)
			{
				shortNameLengthArray[i]=array[19+i];
			}

			err_code=setAdvNameLength(atoi(shortNameLengthArray));

			if(err_code==NRF_SUCCESS)
				printf("OK\r\n");
			else
				printf("ERROR: %lu \r\n", (unsigned long)err_code);
		}
		else if(strstr(commands,"at+mtu_att_size=")!=NULL)
		{
			memset(&attMtuSizeArray[0], 0, sizeof(attMtuSizeArray));
			for (i=0;i<(length-16);i++)
			{
				attMtuSizeArray[i]=array[16+i];
			}

			err_code=changeMtuAttSize(atoi(attMtuSizeArray));

			if(err_code==NRF_SUCCESS)
				printf("OK\r\n");
			else
				printf("ERROR: %lu \r\n", (unsigned long)err_code);
		}
		else if(strstr(commands,"at+reset")!=NULL)
		{
			err_code=resetDevice();
			if(err_code==NRF_SUCCESS)
				printf("OK\r\n");
			else
				printf("ERROR: %lu \r\n", (unsigned long)err_code);
		}
		else if(strstr(commands,"at+softdevStop")!=NULL)
		{
			err_code=stopSoftDevice();

			if(err_code==NRF_SUCCESS)
				printf("OK\r\n");
			else
				printf("ERROR: %lu \r\n", (unsigned long)err_code);
		}
		else if(strstr(commands,"at+shutdown")!=NULL)
		{
			stopSoftDevice();
			sd_power_system_off();
		}
		else if(strstr(commands,"at+adv_stop")!=NULL)
		{
			err_code=stopAdv();
			if(err_code==NRF_SUCCESS)
				printf("OK\r\n");
			else
				printf("ERROR: %lu \r\n", (unsigned long)err_code);
		}
		else if(strstr(commands,"at+adv_start")!=NULL)
		{

			err_code =startAdv(); //start
			if(err_code==NRF_SUCCESS)
				printf("OK\r\n");
			else
				printf("ERROR: %lu \r\n", (unsigned long)err_code);
		}
		else if(strstr(commands,"at+disconnect")!=NULL)
		{
			err_code=disconnectFromMaster();
			if(err_code==NRF_SUCCESS)
				printf("OK\r\n");
			else
				printf("ERROR: %lu \r\n", (unsigned long)err_code);
		}
		else if(strstr(commands,"at+power=")!=NULL)
		{
			memset(&power[0], 0, sizeof(power));

			for (i=0;i<(length-9);i++)
			{
				power[i]=array[9+i];
			}

			err_code=changeTransmitPower(atoi(&power[0]));
			if(err_code==NRF_SUCCESS)
				printf("OK\r\n");
			else
				printf("ERROR: %lu \r\n", (unsigned long)err_code);
		}
		else if(strstr(commands,"at+addr")!=NULL)
		{
			ble_gap_addr_t  p_addr;

			sd_ble_gap_addr_get(&p_addr);
			 printf("MAC Address : %02x:%02x:%02x:%02x:%02x:%02x\n",
			  (unsigned char) p_addr.addr[5],
			  (unsigned char) p_addr.addr[4],
			  (unsigned char) p_addr.addr[3],
			  (unsigned char) p_addr.addr[2],
			  (unsigned char) p_addr.addr[1],
			  (unsigned char) p_addr.addr[0]);
		}
		else if(strstr(commands,"at+send=")!=NULL)
		{
			memset(&sendBuffer[0], 0, sizeof(sendBuffer));

			for (i=0;i<(length-8);i++)
			{
				sendBuffer[i]=array[8+i];
			}
			err_code=sendBleText(sendBuffer,(length-8));
			if(err_code==NRF_SUCCESS)
				printf("OK\r\n");
			else
				printf("ERROR: %lu \r\n", (unsigned long)err_code);
		}
		else if(strstr(commands,"at+phy_mode=")!=NULL)
		{

			err_code=changePhyMode((uint8_t)array[12]);

		  if(err_code==NRF_SUCCESS)
				printf("OK\r\n");
			else
				printf("ERROR: %lu \r\n", (unsigned long)err_code);
		}
		else if(strstr(commands,"at+uuids")!=NULL)
		{
			for (i=0;i<(sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]));i++)
			{
				printf("UUID TYPE: ");
				printf("%d\r\n", m_adv_uuids[i].type);
				printf("UUID VALUE: ");
				printf("%d\r\n", m_adv_uuids[i].uuid);
			}
		}

		else
			printf("\r\nCommand not recognized\r\n");
	else
		printf("\r\nNot valid, try again\r\n");
}
void atCommandAction(char data_array[],uint8_t index)
{
	getCommandType(data_array,index+1);

